axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"

#include "interfaces/http/Dnsd.h"
#include "interfaces/http/Http.h"

// generated web content
#include "generated/index_html.h"
#include "generated/jquery_min_js.h"
#include "generated/jquery_mobile_js.h"
#include "generated/jquery_mobile_css.h"
#include "generated/jquery_simple_websocket.h"
#include "generated/jq_clock.h"
#include "generated/ajax_loader.h"
#include "generated/loco_32x32.h"

using esp32cs::http::Httpd;
using esp32cs::http::HttpMethod;
using esp32cs::http::HttpRequest;
using esp32cs::http::HttpStatusCode;
using esp32cs::http::AbstractHttpResponse;
using esp32cs::http::StringResponse;
using esp32cs::http::WebSocketFlow;
using esp32cs::http::MIME_TYPE_TEXT_HTML;
using esp32cs::http::MIME_TYPE_TEXT_PLAIN;
using esp32cs::http::MIME_TYPE_TEXT_CSS;
using esp32cs::http::MIME_TYPE_IMAGE_PNG;
using esp32cs::http::MIME_TYPE_IMAGE_GIF;
using esp32cs::http::MIME_TYPE_TEXT_JAVASCRIPT;
using esp32cs::http::MIME_TYPE_APPLICATION_JSON;
using esp32cs::http::HTTP_ENCODING_GZIP;
using esp32cs::http::WebSocketEvent;

// Captive Portal landing page
static constexpr const char * const CAPTIVE_PORTAL_HTML =
  "<html>"
  "<title>ESP32 Command Station v%s</title>"
  "<meta http-equiv=\"refresh\" content=\"30;url='/captiveauth'\" /> "
  "<body>"
  "<h1>Welcome to the ESP32 Command Station</h1>"
  "<h2>Open your browser and navigate to any website and it will open the "
  "ESP32 Command Station</h2>"
  "<p>Click <a href=\"/captiveauth\">here</a> to close this portal "
  "page if it does not automatically close.</p>" 
  "</body>"
  "</html>";

uninitialized<Httpd> httpd;
Atomic webSocketAtomic;
vector<unique_ptr<WebSocketClient>> webSocketClients;
WEBSOCKET_STREAM_HANDLER(process_websocket_event);
HTTP_STREAM_HANDLER(process_ota);
HTTP_HANDLER(process_power);
HTTP_HANDLER(process_config);
HTTP_HANDLER(process_prog);
HTTP_HANDLER(process_turnouts);
HTTP_HANDLER(process_loco);
HTTP_HANDLER(process_outputs);
HTTP_HANDLER(process_sensors);
HTTP_HANDLER(process_remote_sensors);
HTTP_HANDLER(process_s88);

void init_webserver(MDNS *dns)
{
  httpd.emplace(dns);
  httpd->redirect_uri("/", "/index.html");
  // if the soft AP interface is enabled, setup the captive portal
  if (configStore->isAPEnabled())
  {
    httpd->captive_portal(StringPrintf(CAPTIVE_PORTAL_HTML, PROJECT_VER));
  }
  httpd->static_uri("/index.html", indexHtmlGz, indexHtmlGz_size
                  , MIME_TYPE_TEXT_HTML, HTTP_ENCODING_GZIP);
  httpd->static_uri("/loco-32x32.png", loco32x32, loco32x32_size
                  , MIME_TYPE_IMAGE_PNG);
  httpd->static_uri("/jquery.min.js", jqueryJsGz, jqueryJsGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.mobile-1.5.0-rc1.min.js", jqueryMobileJsGz
                  , jqueryMobileJsGz_size, MIME_TYPE_TEXT_JAVASCRIPT
                  , HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.mobile-1.5.0-rc1.min.css", jqueryMobileCssGz
                  , jqueryMobileCssGz_size, MIME_TYPE_TEXT_CSS
                  , HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.simple.websocket.min.js"
                  , jquerySimpleWebSocketGz, jquerySimpleWebSocketGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/jqClock-lite.min.js", jqClockGz, jqClockGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/images/ajax-loader.gif", ajaxLoader, ajaxLoader_size
                  , MIME_TYPE_IMAGE_GIF);
  httpd->websocket_uri("/ws", process_websocket_event);
  httpd->uri("/update", HttpMethod::POST, nullptr, process_ota);
  httpd->uri("/features", [&](HttpRequest *req)
  {
    return new StringResponse(configStore->getCSFeatures()
                            , MIME_TYPE_APPLICATION_JSON);
  });
  httpd->uri("/power", HttpMethod::GET | HttpMethod::PUT, process_power);
  httpd->uri("/config", HttpMethod::GET | HttpMethod::POST, process_config);
  httpd->uri("/programmer", HttpMethod::GET | HttpMethod::POST, process_prog);
  httpd->uri("/turnouts"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_turnouts);
  httpd->uri("/locomotive"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
  httpd->uri("/locomotive/roster"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
  httpd->uri("/locomotive/estop"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
#if ENABLE_OUTPUTS
  httpd->uri("/outputs"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_outputs);
#endif // ENABLE_OUTPUTS
#if ENABLE_SENSORS
  httpd->uri("/sensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_sensors);
  httpd->uri("/remoteSensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_remote_sensors);
#if S88_ENABLED
  httpd->uri("/s88sensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_s88);
#endif // S88_ENABLED
#endif // ENABLE_SENSORS
}

